# Inleiding

### Use case
Titanic algemeen, kans op overleven, maar zou jij het overleefd hebben?!
Met Machine Learning algoritmes kun je inschatten of iemand wel/niet overleeft zou hebben. Hierbij spreekt men van een classificatie algoritme. Er zijn immers 2 opties: Wel / niet overleven. 

### Instructies omgeving
Stukje over Google Colab met de belangrijkste toets-combinaties / ... 

### Imports & settings
Importeer de functies benodigd voor de training (of... dit gebeurd in cellen vooraf door cursusleider)

In [1]:
# Imports
from scripts.preprocess.preprocessing import return_config, laden_data, toevoegen_passagiers 
# from scripts.evaluation.plotting import 

# Settings

Toelichting Data Science, train/test principe. 

Laten we eens gaan kijken naar de dataset voor het trainen en testen van een model...

In [2]:
df_train, df_test = laden_data()
display(df_train.head(), df_test.head())

,01_Passagier_Id,02_Naam,03_Geslacht,04_Leeftijd,05_Opstapplaats,06_Aantal_kinderen,07_Aantal_overige_familieleden,08_Ticket_nummer,09_Ticket_klasse,10_Ticket_prijs,11_Cabine_nummer,12_Overleefd
0,1,"Braund, Mr. Owen Harris",male,22.0,S,0,1,A/5 21171,3,7.2500,NaN,0
1,2,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,C,0,1,PC 17599,1,71.2833,C85,1
2,3,"Heikkinen, Miss. Laina",female,26.0,S,0,0,STON/O2. 3101282,3,7.9250,NaN,1
3,4,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,S,0,1,113803,1,53.1000,C123,1
4,5,"Allen, Mr. William Henry",male,35.0,S,0,0,373450,3,8.0500,NaN,0

,01_Passagier_Id,02_Naam,03_Geslacht,04_Leeftijd,05_Opstapplaats,06_Aantal_kinderen,07_Aantal_overige_familieleden,08_Ticket_nummer,09_Ticket_klasse,10_Ticket_prijs,11_Cabine_nummer
0,892,"Kelly, Mr. James",male,34.5,Q,0,0,330911,3,7.8292,NaN
1,893,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,S,0,1,363272,3,7.0000,NaN
2,894,"Myles, Mr. Thomas Francis",male,62.0,Q,0,0,240276,2,9.6875,NaN
3,895,"Wirz, Mr. Albert",male,27.0,S,0,0,315154,3,8.6625,NaN
4,896,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,S,1,1,3101298,3,12.2875,NaN

Toelichting dataset (naslagwerk):
...

Laten we onszelf toevoegen aan de dataset.

Mogelijke vraag (om te kijken of ze opletten/begrepen hebben): Welke dataset zou dat zijn?!

toevoegen_passagiers() # pop-up venster?